<h1>Atividade de Projeto Estruturado 11 - APE11</h1>
<p><span style="font-weight: 400;">Para que serve o commit e qual a melhor forma de utiliz&aacute;-lo?</span></p>
<p><span style="font-weight: 400;">O commit &eacute; uma das principais funcionalidades do sistema de controle de vers&atilde;o Git. Ele registra as altera&ccedil;&otilde;es feitas nos arquivos do reposit&oacute;rio. Ele serve para criar um ponto de refer&ecirc;ncia no hist&oacute;rico do projeto, permitindo rastrear e comparar altera&ccedil;&otilde;es ao longo do tempo. A melhor forma de utiliz&aacute;-lo &eacute; criar commits at&ocirc;micos e significativos, focados em uma &uacute;nica tarefa ou funcionalidade. Isso facilita a compreens&atilde;o das altera&ccedil;&otilde;es e ajuda a manter um hist&oacute;rico claro e organizado.</span></p>
<p><span style="font-weight: 400;">Qual a diferen&ccedil;a entre commit e push?</span></p>
<p><span style="font-weight: 400;">O commit e o push s&atilde;o duas opera&ccedil;&otilde;es distintas no Git. O commit &eacute; usado para registrar altera&ccedil;&otilde;es em um reposit&oacute;rio local, enquanto o push &eacute; usado para enviar os commits para o reposit&oacute;rio remoto.</span></p>
<p><span style="font-weight: 400;">Quando fazemos um commit, as altera&ccedil;&otilde;es s&atilde;o gravadas apenas no reposit&oacute;rio local. J&aacute; o push &eacute; necess&aacute;rio para sincronizar os commits locais com o reposit&oacute;rio remoto, tornando as altera&ccedil;&otilde;es dispon&iacute;veis para outros colaboradores do projeto.</span></p>
<p><span style="font-weight: 400;">Dessa forma, o commit &eacute; uma opera&ccedil;&atilde;o local, que atua apenas no reposit&oacute;rio local, enquanto o push &eacute; uma opera&ccedil;&atilde;o remota que possibilita compartilhar as altera&ccedil;&otilde;es com outras pessoas.</span></p>
<p><span style="font-weight: 400;">O que &eacute; tag?</span></p>
<p><span style="font-weight: 400;">Uma tag no Git &eacute; uma refer&ecirc;ncia est&aacute;tica a um ponto espec&iacute;fico na hist&oacute;ria do projeto. Ela &eacute; usada para marcar vers&otilde;es importantes, como releases ou milestones, facilitando a identifica&ccedil;&atilde;o e o acesso a vers&otilde;es espec&iacute;ficas do software. As tags s&atilde;o &uacute;teis para identificar e recuperar vers&otilde;es espec&iacute;ficas do projeto de forma mais f&aacute;cil. Elas geralmente s&atilde;o usadas quando voc&ecirc; deseja marcar um ponto est&aacute;vel em seu c&oacute;digo ou lan&ccedil;ar uma nova vers&atilde;o do software para os usu&aacute;rios.</span></p>
<p><span style="font-weight: 400;">O que &eacute; branch?</span></p>
<p><span style="font-weight: 400;">Um branch no Git &eacute; uma ramifica&ccedil;&atilde;o independente do desenvolvimento do c&oacute;digo-fonte. Ele permite que os desenvolvedores trabalhem em diferentes funcionalidades ou corre&ccedil;&otilde;es sem interferir no c&oacute;digo principal. Cada branch pode ser editado, testado e fundido (merge) de volta ao branch principal (normalmente chamado de "master" ou "main") quando a funcionalidade estiver pronta ou o bug for corrigido. Branches s&atilde;o &uacute;teis para o desenvolvimento colaborativo, pois permitem que v&aacute;rias pessoas trabalhem em diferentes partes do projeto simultaneamente. Al&eacute;m disso, eles fornecem uma maneira de experimentar novos recursos ou corre&ccedil;&otilde;es de bugs sem modificar imediatamente a branch principal.</span></p>
<p><span style="font-weight: 400;">Como resolver poss&iacute;veis conflitos no Git?</span></p>
<p><span style="font-weight: 400;">Para resolver poss&iacute;veis conflitos no Git, primeiro &eacute; importante entender que conflitos ocorrem quando duas ou mais branches modificam o mesmo trecho de c&oacute;digo. A melhor abordagem &eacute; evitar conflitos ao manter as altera&ccedil;&otilde;es pequenas e frequentes, e ao comunicar-se com a equipe para garantir que todos estejam cientes das altera&ccedil;&otilde;es em andamento. Se ocorrerem conflitos, a solu&ccedil;&atilde;o envolve realizar um merge ou rebase, manualmente escolhendo qual vers&atilde;o do c&oacute;digo deve prevalecer. O Git sinaliza os trechos conflitantes, permitindo que o desenvolvedor revise, edite e resolva as diferen&ccedil;as.</span></p>
<p><br /><br /><br /><br /></p>

<li><a href="Menu.html">Menu</li>